[
    {
      "id": 1,
      "name": "Spaghetti Bolognese",
      "description": "A classic Italian pasta dish with a rich and flavorful meat sauce.",
      "ingredients": ["Spaghetti", "Ground beef", "Onion", "Garlic", "Tomato sauce", "Tomato paste", "Olive oil", "Carrots", "Celery", "Salt", "Black pepper", "Basil", "Parmesan cheese"],
      "instructions": "To prepare Spaghetti Bolognese, start by heating olive oil in a large pan over medium heat. Add finely chopped onions and minced garlic, and sauté them until soft and fragrant. Next, add the ground beef and cook it thoroughly, breaking it into smaller pieces with a wooden spoon as it browns. Stir in tomato paste and tomato sauce, then add finely chopped carrots and celery for added flavor and texture. Reduce the heat to low and allow the sauce to simmer gently for about 30 minutes, stirring occasionally to prevent sticking. Meanwhile, bring a large pot of salted water to a boil and cook the spaghetti until it reaches an al dente texture. Drain the spaghetti and divide it onto serving plates. Pour the rich and hearty Bolognese sauce over the spaghetti, and garnish with freshly grated Parmesan cheese and a sprinkle of basil. Serve hot and enjoy a delicious Italian classic.",
      "cookingTime": 45,
      "category": "Dinner",
      "image": "https://i.ibb.co.com/y09R7yV/Vegetable-Stir-Fry-10.webp",
      "createdBy": "Chef Mario"
    },
    {
      "id": 2,
      "name": "Chicken Caesar Salad",
      "description": "A crisp salad with grilled chicken, fresh lettuce, and a creamy Caesar dressing.",
      "ingredients": ["Chicken breast", "Romaine lettuce", "Croutons", "Parmesan cheese", "Caesar dressing", "Lemon"],
      "instructions": "Grill the chicken breast until cooked through, then slice it thinly. Toss the romaine lettuce with croutons, grated Parmesan, and Caesar dressing. Top with the sliced chicken, squeeze fresh lemon juice, and enjoy a healthy yet delicious meal.",
      "cookingTime": 20,
      "category": "Salad",
      "image": "https://i.ibb.co.com/chicken-caesar-salad.jpg",
      "createdBy": "Chef Anna"
    },
    {
      "id": 3,
      "name": "Vegan Stir Fry",
      "description": "A colorful stir fry with tofu, vegetables, and soy sauce.",
      "ingredients": ["Tofu", "Bell peppers", "Carrot", "Broccoli", "Soy sauce", "Ginger", "Garlic", "Sesame oil"],
      "instructions": "Sauté tofu cubes in sesame oil until crispy, then remove them from the pan. In the same pan, stir fry the vegetables with ginger, garlic, and soy sauce until tender. Add the tofu back in and toss everything together. Serve hot with rice or noodles.",
      "cookingTime": 25,
      "category": "Vegan",
      "image": "https://i.ibb.co.com/vegan-stir-fry.jpg",
      "createdBy": "Chef Maya"
    },
    {
      "id": 4,
      "name": "Beef Tacos",
      "description": "Ground beef seasoned with spices, served in soft tortillas with toppings.",
      "ingredients": ["Ground beef", "Taco seasoning", "Taco shells", "Lettuce", "Tomatoes", "Cheese", "Sour cream"],
      "instructions": "Brown the ground beef in a pan with taco seasoning. While the beef is cooking, prepare the toppings: chop the lettuce and tomatoes, and shred the cheese. Fill each taco shell with the cooked beef, then add your desired toppings.",
      "cookingTime": 15,
      "category": "Dinner",
      "image": "https://i.ibb.co.com/beef-tacos.jpg",
      "createdBy": "Chef Luis"
    },
    {
      "id": 5,
      "name": "Vegetable Soup",
      "description": "A hearty soup filled with vegetables and a flavorful broth.",
      "ingredients": ["Carrots", "Celery", "Potatoes", "Onions", "Tomatoes", "Vegetable broth", "Garlic", "Spinach", "Thyme"],
      "instructions": "Sauté onions and garlic in a pot. Add carrots, celery, potatoes, and tomatoes, and cook for a few minutes. Add vegetable broth and thyme, and let it simmer until the vegetables are tender. Stir in spinach at the end and serve hot.",
      "cookingTime": 30,
      "category": "Soup",
      "image": "https://i.ibb.co.com/vegetable-soup.jpg",
      "createdBy": "Chef Emily"
    },
    {
      "id": 6,
      "name": "Chicken Alfredo",
      "description": "A creamy pasta dish with grilled chicken and a rich Alfredo sauce.",
      "ingredients": ["Chicken breast", "Pasta", "Heavy cream", "Parmesan cheese", "Garlic", "Butter", "Olive oil"],
      "instructions": "Grill the chicken breast and slice it thinly. Cook the pasta until al dente. In a pan, melt butter, sauté garlic, then add cream and Parmesan cheese. Simmer to thicken, then toss the pasta in the sauce and top with the sliced chicken.",
      "cookingTime": 35,
      "category": "Dinner",
      "image": "https://i.ibb.co.com/chicken-alfredo.jpg",
      "createdBy": "Chef Marco"
    },
    {
      "id": 7,
      "name": "Quinoa Salad",
      "description": "A refreshing salad made with quinoa, vegetables, and a lemon dressing.",
      "ingredients": ["Quinoa", "Cucumber", "Tomatoes", "Red onion", "Feta cheese", "Lemon", "Olive oil", "Parsley"],
      "instructions": "Cook quinoa as per package instructions and let it cool. Chop the vegetables and mix them with the quinoa. In a small bowl, whisk together lemon juice, olive oil, and parsley, and toss the dressing with the salad.",
      "cookingTime": 20,
      "category": "Salad",
      "image": "https://i.ibb.co.com/quinoa-salad.jpg",
      "createdBy": "Chef Sofia"
    },
    {
      "id": 8,
      "name": "Pancakes",
      "description": "Fluffy pancakes topped with syrup and fresh fruit.",
      "ingredients": ["Flour", "Baking powder", "Sugar", "Milk", "Eggs", "Butter", "Vanilla extract"],
      "instructions": "Mix the dry ingredients, then add the wet ingredients and stir until smooth. Pour batter onto a heated griddle and cook until bubbles form on the surface. Flip and cook until golden brown. Serve with syrup and fresh fruit.",
      "cookingTime": 20,
      "category": "Breakfast",
      "image": "https://i.ibb.co.com/pancakes.jpg",
      "createdBy": "Chef Kate"
    },
    {
      "id": 9,
      "name": "Falafel",
      "description": "Crispy fried chickpea balls served with pita and tahini sauce.",
      "ingredients": ["Chickpeas", "Garlic", "Onion", "Cumin", "Coriander", "Parsley", "Flour", "Tahini", "Pita"],
      "instructions": "Blend chickpeas with garlic, onion, and spices, then form into small balls. Fry until golden brown. Serve with pita and tahini sauce.",
      "cookingTime": 30,
      "category": "Vegan",
      "image": "https://i.ibb.co.com/falafel.jpg",
      "createdBy": "Chef Samira"
    },
    {
      "id": 10,
      "name": "Grilled Cheese Sandwich",
      "description": "A classic grilled cheese sandwich with crispy, golden bread and melted cheese.",
      "ingredients": ["Bread", "Cheese", "Butter"],
      "instructions": "Butter the outside of two slices of bread, then place cheese in the middle. Grill the sandwich in a pan until both sides are golden brown and the cheese is melted.",
      "cookingTime": 10,
      "category": "Breakfast",
      "image": "https://i.ibb.co.com/grilled-cheese.jpg",
      "createdBy": "Chef James"
    },
    {
      "id": 11,
      "name": "Shakshuka",
      "description": "A North African dish with poached eggs in a spicy tomato and bell pepper sauce.",
      "ingredients": ["Eggs", "Tomatoes", "Bell peppers", "Onion", "Garlic", "Cumin", "Paprika", "Parsley"],
      "instructions": "Cook the onions, garlic, and bell peppers in a skillet. Add tomatoes, cumin, and paprika, and simmer until the sauce thickens. Make wells in the sauce and crack eggs into them. Cover and cook until the eggs are done to your liking. Garnish with parsley.",
      "cookingTime": 25,
      "category": "Breakfast",
      "image": "https://i.ibb.co.com/shakshuka.jpg",
      "createdBy": "Chef Yasmine"
    },
    {
      "id": 12,
      "name": "Mushroom Risotto",
      "description": "A creamy risotto made with fresh mushrooms and Parmesan cheese.",
      "ingredients": ["Rice", "Mushrooms", "Parmesan cheese", "Butter", "Onion", "Garlic", "Vegetable broth"],
      "instructions": "Sauté onions and garlic in butter, then add rice and toast for a minute. Gradually add vegetable broth, stirring constantly until the rice is cooked. Stir in sautéed mushrooms and Parmesan cheese.",
      "cookingTime": 40,
      "category": "Dinner",
      "image": "https://i.ibb.co.com/mushroom-risotto.jpg",
      "createdBy": "Chef Carlo"
    }
  ]
  